{
  "education": [
    {
      "awards_achievements": [
        "Distinction"
      ],
      "degree": "Bachelor of Electronics and Communication",
      "department": "Electronics and Digital Arts",
      "duration": "2012-2015",
      "school_name": "University of Kent at Canterbury, England"
    },
    {
      "awards_achievements": [
        "2nd in my Cohort"
      ],
      "degree": "Associate Engineering",
      "department": "International Engineering",
      "duration": "2011-2012",
      "school_name": "Kingston University of London"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_awaiszafar",
  "highlighted_projects": [
    {
      "description": "Designed a webpage using HTML5 and CSS as the first step toward getting into the software industry which included the links to all other similar front-end projects as part of my self-study front-end development course. This project aimed to use all the features provided by the tools like HTML5 and CSS to design a webpage.",
      "git_url": "https://codepen.io/awais-zafar/full/VwrmjOe",
      "name": "Personal Portfolio Webpage"
    },
    {
      "description": "A business required document (BRD) was presented, and I was required to prepare a System Required Document (SRD) containing flowcharts of the software design. Developed an online continuous particle flow monitor in pneumatic conveyed pipelines using electrostatic sensors and Arduino as a microcontroller, and C-code was written to implement the graphical user interface, which returns the values measured by the electrostatic sensors and stored into an excel database and extracted if need be through Matlab for graphical representation. As part of my bachelor's final year project, including 100 pages thesis was prepared to document all the details of the project and eventually, the project was presented using .ppt upon completion. As it was an individual project so, a lot of research was done and implemented. It helped me to understand the different factors which need to be taken into consideration for these devices.",
      "name": "Particle Flow Monitor"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux cluster agent to monitor the hardware specifications and memory usage information in real-time. A System Required Document (SRD) was prepared by me initially, containing all the project objectives and identifying the stakeholders. Performed requirement elicitation technique through open interviews with product developers. Data models were created using E-R Diagrams. To collect the data, RDBMS/SQL queries were written along with Linux bash scripts, and crontab was also to save the data over minute intervals. Lastly, after completion of the project, it was presented to the product developer with documentation prepared containing all the technical aspects of the project and was deployed using GitHub.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_AwaisZafar/tree/feature/creating-ddl/linux_sql/scripts",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "A System Required Document was prepared to contain data models using E-R Diagrams and other project objectives. A proof of concept(POC) project to understand customer shopping behaviour for the London Gift shop(LGS), which is an online giftware store in the UK that has been running for more than ten years. The revenue has not grown in recent years so the LGS marketing team wants to utilize the latest data technologies to understand the customer better. LGS team hires Jarvis data engineering services since the LGS IT dept doesn't have enough resources to work on more projects. The LGS marketing team will use the final data analytics product to develop targeted marketing campaigns to attract new or existing customers. The project was divided into two parts. First is setting up a data warehouse for Online analytical processing (OLAP) operations which were done by dumping LGS retail data into the PostgreSQL database, which was provisioned using a docker container. The second part of the project was to develop a notebook that answers business questions compiled by the data analysts. The technologies that were used to solve the business questions were Python, Jupyter Notebook which was also provisioned using a docker container, Pandas Dataframe, and Numpy. The final product was deployed using Github.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_AwaisZafar/tree/feature/python-data-analytics",
      "name": "Python Data Analytics"
    }
  ],
  "name": "Awais Zafar",
  "others": [
    {
      "bullets": [
        "Responsive Web Design(2022)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Chess player",
        "Active member of Durham Chess Club",
        "Former member of University of kent Chess Society"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting",
      "description": "Worked in Agile/Scrum environment to develop and implement projects like Linux cluster monitoring system and python data analytics. Work with a team of developers, a Scrum Master, and a Product Developer. The team has scrum meetings daily to assign tasks for the day. Responsibilities included were to design and writing the codes and deploying them on the GitHub repo, which was later merged onto the develop branch after senior developer review. Gained a high-level knowledge of software development life cycle. Also, I worked on a Business System Analyst course which helped me to understand the Bank's line of business",
      "duration": "2022-present",
      "title": "Junior Business System Analyst"
    },
    {
      "company": "TurboTax Canada",
      "description": "A seasonal contract remote work to help customers all over Canada file their taxes using the TurboTax software on call and sometimes by screen-sharing. To help them effectively, I used requirement elicitation skills to understand the issue at hand, and I had 99% positive reviews on the survey that the customers used to fill out after every call. The job required multi-tasking as the agents also have to update the customer's profile on salesfloor or process a refund if need be while on the call.",
      "duration": "2021-2022",
      "title": "Product/Tax Virtual Assistance Agent"
    },
    {
      "company": "A-Z User Car Dealership",
      "description": " Greeted and actively listened and used elicitation technique to understand customers to uncover purchasing needs and provide recommendations based on automotive requirements. Used consultative sales process to match customers with vehicles suiting their needs. Demonstrated vehicle functionality and explained options, accompanied prospective customers on test drives, and explained costs associated with the purchase. Used to deal with accounts and a small staff of 10 people",
      "duration": "2018-2021",
      "title": "Sole Proprietor"
    }
  ],
  "skills": {
    "Business Skills": [
      "Requirement Elicitation",
      "Presentation",
      "Documentation",
      "Effective Communication and interpersonal",
      "Decision-Making Skills",
      "Networking",
      "Data Analysis Skills",
      "Problem-Solving"
    ],
    "Technical Skills": [
      "RDBMS/SQL queries",
      "Data Modeling/Mapping",
      "Data Analytics using Python, Pandas, NumPy.",
      "Agile/Scrum",
      "Linux/Bash Scripts",
      "GitHub",
      "MS Excel(Pivot table/Formulae)",
      "MS Visio",
      "MS Word",
      "MS PowerPoint",
      "HTML5 and CSS",
      "Google Cloud Platform",
      "Matlab",
      "C Pragramming",
      "Salesforce"
    ]
  },
  "summary": "I have the ability to break things down and communicate to any level. I have the right mix of strategic thinking and the ability to influence gained over the years working as a sole proprietor. I am extremely good at building up and nurturing interpersonal relationships. I have a high awareness of business goals and business organization. I am very attentive to details and always willing to take the extra step to accomplish things. I also have utilized requirement elicitation skills in the previous job to understand all the client's needs and objectives. I am very good at ensuring things get done and done right. I have fine people skills, am analytical, and can think on my feet, combined with savvy computer skills. I have utilized the skills needed for presenting on several occasions academically and professionally. As an investor in Forex and Stocks, I have the basic knowledge of how wealth management works. Because of my graduate degree in Electronics and Communications Engineering from the University of Kent, England, I am well versed in a good range of programming and database skills across many platforms. Therefore, I wish to be considered for a Business System Analyst role where I can use my skills and work in a team setting to improve my leadership skills"
}
